tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "ccls"
brew "fzf"
brew "gcc"
brew "icarus-verilog"
brew "md5sha1sum"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "wget"
cask "font-fira-code-nerd-font"
cask "gtkwave"
cask "wine-stable"
cask "xquartz"
