tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "bat"
brew "black"
brew "llvm"
brew "ccls"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdb"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "htslib"
brew "icarus-verilog"
brew "libomp"
brew "python@3.12"
brew "llvm@16"
brew "md5sha1sum", link: false
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "samtools"
brew "tmux"
brew "tree"
brew "wget"
brew "wimlib"
cask "emacs-app"
cask "font-fira-code-nerd-font"
cask "gstreamer-runtime"
cask "gtkwave"
cask "wine-stable"
cask "xquartz"
